Public Attributes | List of all members
API_GridEdgeInfo Struct Reference
Element Manager API
Contains extended information of a API_GridMeshEdge. More...
#include <APIdefs_Base.h>
 Public Attributes
API_GridElemID  | id
The identifier of the edge, the info belongs to.
bool  | mainAxis
Whether it belongs to the main axis or not.
Detailed Description
Contains extended information of a API_GridMeshEdge.
Remarks
The main axis is vertical. For more information see API_GridMesh.
Member Data Documentation
◆ id
 API_GridEdgeInfo::id
The identifier of the edge, the info belongs to.
◆ mainAxis
 API_GridEdgeInfo::mainAxis
Whether it belongs to the main axis or not.